#### BoundaryCurves Property

---

|  |
| --- |
| Opening Class   See Also |

The geometry information for non-rectangular openings in project documents, or for all openings in family documents.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveArray BoundaryCurves { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property BoundaryCurves As CurveArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property CurveArray^ BoundaryCurves { 	CurveArray^ get (); } ``` |

# Remarks

If  IsRectBoundary  is true, this value is    a null reference (  Nothing  in Visual Basic)  .

# See Also

Opening Class

Autodesk.Revit.DB Namespace